In [2]:
# Data source: https://www.cdc.gov/brfss/annual_data/annual_2019.html
# Codebook: https://www.cdc.gov/brfss/annual_data/2019/pdf/codebook19_llcp-v2-508.HTML

# import libraries
import seaborn as sns
import pandas as pd

# import dataset
# Note that _SEX = 2 --> Female, _SEX = 1 --> Male, and _STATE = 9 --> Connecticut
data = pd.read_csv("BRFSS 19 data.csv")
data.head()

,Unnamed: 0,_STATE,FMONTH,IDATE,IMONTH,IDAY,IYEAR,DISPCODE,SEQNO,_PSU,...,_VEGESU1,_FRTLT1A,_VEGLT1A,_FRT16A,_VEG23A,_FRUITE1,_VEGETE1,_FLSHOT7,_PNEUMO3,_AIDTST4
0,1,1,1,1182019,1,18,2019,1100,2019000001,2.019000e+09,...,114.0,1,1,1,1,0,0,2.0,1.0,2.0
1,2,1,1,1132019,1,13,2019,1100,2019000002,2.019000e+09,...,121.0,1,1,1,1,0,0,1.0,1.0,2.0
2,3,1,1,1182019,1,18,2019,1100,2019000003,2.019000e+09,...,164.0,1,1,1,1,0,0,1.0,2.0,2.0
3,4,1,1,1182019,1,18,2019,1200,2019000004,2.019000e+09,...,NaN,9,9,1,1,1,1,9.0,9.0,NaN
4,5,1,1,1042019,1,4,2019,1100,2019000005,2.019000e+09,...,178.0,1,1,1,1,0,0,2.0,1.0,2.0

In [23]:
# extract only Connecticut respondents
conn_data = data[data['_STATE']==9].drop(columns='_STATE')
conn_data.head()

,Unnamed: 0,FMONTH,IDATE,IMONTH,IDAY,IYEAR,DISPCODE,SEQNO,_PSU,CTELENM1,...,_VEGESU1,_FRTLT1A,_VEGLT1A,_FRT16A,_VEG23A,_FRUITE1,_VEGETE1,_FLSHOT7,_PNEUMO3,_AIDTST4
45259,45260,7,8232019,8,23,2019,1200,2019000001,2.019000e+09,NaN,...,43.0,1,2,1,1,0,0,NaN,NaN,1.0
45260,45261,7,9202019,9,20,2019,1200,2019000002,2.019000e+09,NaN,...,210.0,1,1,1,1,0,0,NaN,NaN,2.0
45261,45262,10,10292019,10,29,2019,1200,2019000003,2.019000e+09,NaN,...,NaN,2,9,1,1,0,1,NaN,NaN,NaN
45262,45263,7,8072019,8,7,2019,1200,2019000004,2.019000e+09,NaN,...,422.0,1,1,1,1,0,0,NaN,NaN,1.0
45263,45264,10,10122019,10,12,2019,1200,2019000005,2.019000e+09,NaN,...,99.0,1,2,1,1,0,0,NaN,NaN,1.0

In [24]:
# extract EXRACT11 non-nan unique values
# Favorite activity is Horseback riding == 24
exract11 = conn_data['EXRACT11'].dropna()
unique_exract11 = set(exract11)
unique_exract11
print("Horseback riding is in dataset is", 24.0 in unique_exract11)

Horseback riding is in dataset is True

In [44]:
# find number of male and female respondents who selected horseback riding
exract11_data = conn_data[conn_data['EXRACT11']==24.0]
sex = exract11_data.groupby('_SEX')['Unnamed: 0'].count()
females = 0
males = 0
if 1 in sex:
    males = sex[1]
if 2 in sex:
    females = sex[2]
print("The number of males who chose horseback riding is", males)
print("The number of females who chose horseback riding is", females)

The number of males who chose horseback riding is 0
The number of females who chose horseback riding is 8

In [51]:
# bonus: average height of connecticut respondents
conn_heights = conn_data['HTIN4'].dropna()
avg_conn_height = conn_heights.sum()/conn_heights.count()
print("The average height for a person in the state of Connecticut is", round(avg_conn_height, 1), "inches.")

The average height for a person in the state of Connecticut is 66.7 inches.